In [43]:
#importar librerias
import pandas as pd
import numpy as np

EXTRAER LOS DATOS

In [44]:
dfs = pd.read_excel('base_datos.xlsx', sheet_name=None) #importamos el libro de Excel

In [45]:
df_ventas = dfs['ventas']
df_clientes = dfs['clientes']    #se separa las hojas de Excel en diferentes dataframes 
df_productos = dfs['productos']

EXPLORACION DE LOS DATOS IMPORTADOS

In [46]:
df_ventas.info() #se valida los datos de la tabla de ventas y se evidencian datos faltantes
                 #id_cliente y id_producto estan como decimales, se deben pasar a enteros

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_venta         400 non-null    int64
 1   fecha_venta      399 non-null    datetime64[ns]
 2   id_cliente       399 non-null    float64
 3   id_producto      399 non-null    float64
 4   cantidad         400 non-null    int64
 5   precio_unitario  399 non-null    float64
 6   total_venta      400 non-null    int64
dtypes: datetime64[ns](1), float64(3), int64(3)
memory usage: 22.0 KB

In [47]:
df_clientes.info() #no se evidencia datos faltantes en la tabla de clientes
                   #el tipo de datos esta correcto

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_cliente      30 non-null     int64
 1   nombre_cliente  30 non-null     object
 2   ciudad          30 non-null     object
 3   email           30 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.1+ KB

In [48]:
df_productos.info() #no se evidencia tampoco datos faltantes en la tabla de productos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_producto      50 non-null     int64
 1   nombre_producto  50 non-null     object
 2   categoria        50 non-null     object
 3   precio           50 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.7+ KB

In [49]:
df_clientes.head(10) #llamo a los primeros 10 datos

   id_cliente    nombre_cliente             ciudad                      email
0           1  Phillip Martinez          Scottfurt        tammy89@example.net
1           2    Heather Thomas      South Brandon     jonathan92@example.net
2           3        Mark Lopez         Josephside    knightkeith@example.org
3           4    Angela Perkins         Marvinbury    hoganhoward@example.net
4           5     Timothy Garza        New Joefurt     perryjason@example.org
5           6      James Morris       Caldwellfurt       pstevens@example.org
6           7     Eugene Garcia       Mcintyreside         dana44@example.org
7           8       Brenda Wang       Santiagofort   yvettebarnes@example.com
8           9   Jackson Charles      Hernandezland     nicholas09@example.org
9          10     Shane Johnson  Port Kathychester  brittneysmith@example.net

In [50]:
df_clientes[~df_clientes['email'].str.contains("@.*.",case=False,regex=True, na=False)] #se filtra el campo Email para saber que correos no cuentan con "@" y "."
                                                                                        #no se evidencia correos con errores

Empty DataFrame
Columns: [id_cliente, nombre_cliente, ciudad, email]
Index: []

In [51]:
df_ventas.head(10) #se llama los 10 primeros datos
                   #se evidencia que la fecha trae formato con dias

,id_venta,fecha_venta,id_cliente,id_producto,cantidad,precio_unitario,total_venta
0,1,2024-03-23,11.0,36.0,3,19717.0,59151
1,2,2024-10-06,23.0,35.0,15,70832.0,1062480
2,3,2024-04-03,23.0,31.0,20,95618.0,1912360
3,4,2024-07-02,30.0,4.0,9,29255.0,263295
4,5,2024-08-19,24.0,14.0,11,87870.0,966570
5,6,2024-12-01,25.0,28.0,10,27940.0,279400
6,7,2024-11-17,17.0,NaN,13,17376.0,225888
7,8,2024-03-05,20.0,13.0,17,32699.0,555883
8,9,2024-07-28,17.0,10.0,16,27007.0,432112
9,10,2024-04-24,24.0,11.0,16,64947.0,1039152

In [52]:
df_productos.head(10)  #se evidencia que algunos datos tienen tildes, se eliminaran las tildes para no tener problemas al enviar los datos a la BD

   id_producto         nombre_producto   categoria  precio
0            1        Silla ergonómica     Oficina   41645
1            2    Escritorio ajustable     Oficina   30473
2            3     Archivador metálico     Oficina   58882
3            4  Calculadora científica     Oficina   29255
4            5    Grapadora industrial     Oficina   45874
5            6        Laptop ultrabook  Tecnología   70682
6            7         Monitor LED 24"  Tecnología   66461
7            8       Mouse inalámbrico  Tecnología   27501
8            9    Teclado mecánico RGB  Tecnología   86097
9           10  Disco duro externo 1TB  Tecnología   27007

TRANSFORMACION DE LOS DATOS

In [53]:
from unidecode import unidecode #importo libreria para eliminar las tildes del dataframe de productos

In [54]:
df_productos = df_productos.applymap(lambda x: unidecode(x) if isinstance(x, str) else x)

In [55]:
df_productos.head(10) #se evidencia que las tildes fueron eliminadas

   id_producto         nombre_producto   categoria  precio
0            1        Silla ergonomica     Oficina   41645
1            2    Escritorio ajustable     Oficina   30473
2            3     Archivador metalico     Oficina   58882
3            4  Calculadora cientifica     Oficina   29255
4            5    Grapadora industrial     Oficina   45874
5            6        Laptop ultrabook  Tecnologia   70682
6            7         Monitor LED 24"  Tecnologia   66461
7            8       Mouse inalambrico  Tecnologia   27501
8            9    Teclado mecanico RGB  Tecnologia   86097
9           10  Disco duro externo 1TB  Tecnologia   27007

In [56]:
df_ventas[df_ventas.isnull().any(axis=1)] #se llaman las filas que estan con campos nulos

,id_venta,fecha_venta,id_cliente,id_producto,cantidad,precio_unitario,total_venta
6,7,2024-11-17,17.0,NaN,13,17376.0,225888
30,31,NaT,2.0,4.0,4,29255.0,117020
117,118,2025-02-16,NaN,10.0,17,27007.0,459119
369,370,2024-12-06,21.0,36.0,15,NaN,295755

In [57]:
df_productos[df_productos['precio'] == 17376]

    id_producto      nombre_producto    categoria  precio
23           24  Power bank 10000mAh  Electronica   17376

In [58]:
df_productos[df_productos['id_producto']==36]

    id_producto    nombre_producto categoria  precio
35           36  Camisa de algodon    Textil   19717

In [59]:
df_ventas.loc[df_ventas['id_producto'].isnull(),"id_producto"] = 24 #ya que conocemos el valor de id_producto lo reemplazamos

In [60]:
df_ventas["id_cliente"].fillna(df_ventas["id_cliente"].mode()[0], inplace=True) #reemplazamos el valor faltante de Id_cliente por el que mas se repite

In [61]:
df_ventas['fecha_venta'].fillna(df_ventas['fecha_venta'].mode()[0], inplace=True) #reemplazamos la fecha por la que mas se repite

In [62]:
df_ventas.loc[df_ventas['precio_unitario'].isnull(), "precio_unitario"] = 19717 #ya que conocemos el valor de valor_unitario lo reemplazamos

In [63]:
df_ventas.info() #evidenciamos que ya no hay datos faltantes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_venta         400 non-null    int64
 1   fecha_venta      400 non-null    datetime64[ns]
 2   id_cliente       400 non-null    float64
 3   id_producto      400 non-null    float64
 4   cantidad         400 non-null    int64
 5   precio_unitario  400 non-null    float64
 6   total_venta      400 non-null    int64
dtypes: datetime64[ns](1), float64(3), int64(3)
memory usage: 22.0 KB

In [64]:
df_ventas['id_cliente'] = df_ventas['id_cliente'].astype(int) #se convierte los campos de id_cliente y id_producto en enteros
df_ventas['id_producto'] = df_ventas['id_producto'].astype(int)

In [65]:
df_ventas['precio_unitario'] = df_ventas['precio_unitario'].astype(int)

In [66]:
df_ventas

,id_venta,fecha_venta,id_cliente,id_producto,cantidad,precio_unitario,total_venta
0,1,2024-03-23,11,36,3,19717,59151
1,2,2024-10-06,23,35,15,70832,1062480
2,3,2024-04-03,23,31,20,95618,1912360
3,4,2024-07-02,30,4,9,29255,263295
4,5,2024-08-19,24,14,11,87870,966570
...,...,...,...,...,...,...,...
395,396,2024-08-22,13,32,2,57907,115814
396,397,2024-07-08,19,38,16,24216,387456
397,398,2024-09-16,13,3,10,58882,588820
398,399,2025-02-03,6,4,16,29255,468080
399,400,2025-02-07,7,14,8,87870,702960

CARGAR INFORMACION A PostgresSQL

In [67]:
from sqlalchemy import create_engine #importo libreria para conexion a PostgresSQL
import psycopg2

In [69]:
engine = create_engine('postgresql://postgres:root@localhost:5432/ventas') #se crea la conexion con PostgreSQL

In [70]:
engine.connect() #se realiza la conexion

In [71]:
print(pd.io.sql.get_schema(df_ventas, name='ventas', con=engine)) #validamos que Postgresql este validando bien el tipo de datos

CREATE TABLE ventas (
	id_venta BIGINT,
	fecha_venta TIMESTAMP WITHOUT TIME ZONE,
	id_cliente INTEGER,
	id_producto INTEGER,
	cantidad BIGINT,
	precio_unitario INTEGER,
	total_venta BIGINT
)

In [72]:
df_ventas.to_sql(name='ventas', con=engine, if_exists='replace', index=False) #se envia la tabla de ventas a PostgreSQL

400

In [73]:
df_productos.to_sql(name='productos', con=engine, if_exists='replace', index=False) #se envia la tabla de productos a PostgreSQL

50

In [74]:
df_clientes.to_sql(name='clientes', con=engine, if_exists='replace', index=False) #se envia la tabla de clientes a PostgreSQL

30